id: ae9b3976-c04b-4ad9-8990-83bfdacbfa84
name: POC - Administrator has Changed Users MFA/ Authentication  Methods
kind: Scheduled
description: |-
  Assess the Context

  Why was the change made?
  Understand if the change was part of routine maintenance, an incident response, or user-requested support.

  Who approved the change?
  Verify if the administrator followed the proper approval process.


  2. Validate the Change

  Check Logs: Confirm the MFA change in the system logs. Look for details like:
  Who made the change.
  Timestamp of the change.
  Justification or associated request ticket.
  Verify with User: Reach out to the affected user to confirm they are aware of the change and can access the updated MFA method.
severity: Medium
queryFrequency: 15m
queryPeriod: 20m
triggerOperator: gt
triggerThreshold: 0
query: |+
  AuditLogs
  | where OperationName == "Admin updated security info"
  | extend parsedTargetResources = parse_json(TargetResources)
  | mv-expand parsedTargetResources
  | extend modifiedProperties = parsedTargetResources.modifiedProperties
  | mv-expand modifiedProperties
  | where tostring(modifiedProperties.oldValue) != tostring(modifiedProperties.newValue)
  | project TimeGenerated, InitiatingUser=InitiatedBy.user.userPrincipalName, TargetedUser=parsedTargetResources.userPrincipalName, OldValue=modifiedProperties.oldValue, NewValue=modifiedProperties.newValue
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: InitiatingUser
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: TargetedUser
customDetails:
  OldValue: OldValue
  NewValue: NewValue
  TimeGenerated: TimeGenerated
sentinelEntitiesMappings:
- columnName: TimeGenerated
suppressionDuration: 5h
suppressionEnabled: false
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: 5h
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
alertDetailsOverride:
  alertDynamicProperties: []
eventGroupingSettings:
  aggregationKind: SingleAlert

